nopnop2002/STM32_TFT_8bit/STM32_TFT_8bit.cpp
/*
 * 8bit TFT Library for STM32F103
 * based on MCUFRIEND_kbv.cpp by David Prentice
 * https://github.com/prenticedavid/MCUFRIEND_kbv
 
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>.
 */

#include <STM32_TFT_8bit.h>
#include <avr/pgmspace.h>
//#include <limits.h>
#include <libmaple/dma.h>

#define MIPI_DCS_REV1   (1<<0)
#define AUTO_READINC    (1<<1)
#define READ_BGR        (1<<2)
#define READ_LOWHIGH    (1<<3)
#define READ_24BITS     (1<<4)
#define XSA_XEA_16BIT   (1<<5)
#define READ_NODUMMY    (1<<6)
#define INVERT_GS       (1<<8)
#define INVERT_SS       (1<<9)
#define MV_AXIS         (1<<10)
#define INVERT_RGB      (1<<11)
#define REV_SCREEN      (1<<12)
#define FLIP_VERT       (1<<13)
#define FLIP_HORIZ      (1<<14)

static uint8_t is8347 = 0;


// Constructor when using 8080 mode of control.
STM32_TFT_8bit::STM32_TFT_8bit(void)
: Adafruit_GFX(TFTWIDTH, TFTHEIGHT) {
  
  //Set PB3 - PB7 as output
  //Note: CRH and CRL are both 32 bits wide
  //Each pin is represented by 5 bits 0x3 (hex) sets that pin to O/P
  TFT_CNTRL->regs->CRL = (TFT_CNTRL->regs->CRL & 0x00000FFF) | 0x33333000;
  CS_IDLE; // Disable CS
//  CD_DATA; // Enable Command
  WR_IDLE; // Disable WR
  RD_IDLE; // Disable RD

  // toggle RST low to reset
  RST_IDLE;   // Set Reset HIGH
  delay(5);
  RST_ACTIVE; // Set Reset LOW
  delay(20);
  RST_IDLE;   // Set Reset HIGH
  delay(150);

#if 0
  //set up 8 bit parallel port to write mode.
  setWriteDataBus();

  // toggle RST low to reset
  TFT_CNTRL->regs->CRH = (TFT_CNTRL->regs->CRH & 0xFFFFFFF0) | 0x00000003; 
  digitalWrite(TFT_RST, HIGH);
  delay(5);
  digitalWrite(TFT_RST, LOW);
  delay(20);
  digitalWrite(TFT_RST, HIGH);
  delay(150);
#endif

}

void STM32_TFT_8bit::setWriteDataBus(void) {
  // set the pins to output mode
  // not required to mask and assign, because all pins of bus are set together
  TFT_DATA->regs->CRL = 0x33333333;
  //each pin is configured by four bits, and 0b0011 or 0x3 means output mode (same as pinmode())
}

void STM32_TFT_8bit::setReadDataBus(void) {
  //set the pins to input mode
  // not required to mask and assign, because all pins of bus are set together
  TFT_DATA->regs->CRL = 0x88888888;
  //8 in hex is 0b1000, which means input, same as pinmode()
  // for (uint8_t i = 0; i <= 7; i++){
  //   pinMode(DPINS[i], INPUT);
  // }
}

void STM32_TFT_8bit::write8(uint8_t c) {

  //BRR or BSRR avoid read, mask write cycle time
  //BSRR is 32 bits wide. 1's in the most significant 16 bits signify pins to reset (clear)
  // 1's in least significant 16 bits signify pins to set high. 0's mean 'do nothing'
  TFT_DATA->regs->BSRR = ((~c)<<16) | (c); //Set pins to the 8 bit number
  //TFT_DATA->regs->ODR = ((TFT_DATA->regs->ODR & 0xFF00) | ((c) & 0x00FF));//FF00 is Binary 1111111100000000
  WR_STROBE;
  //delayMicroseconds(50); //used to observe patterns
}

void STM32_TFT_8bit::writeCmdByte(uint8_t c) {
  CD_COMMAND;
  CS_ACTIVE;
  write8(c);
  CS_IDLE;
}

void STM32_TFT_8bit::writeCmdWord(uint16_t c) {
  CD_COMMAND;
  CS_ACTIVE;
  write8(c >> 8);
  write8(c & 0xff);
  CS_IDLE;
}

void STM32_TFT_8bit::WriteCmd(uint16_t c) {
//  if (_lcd_cmdWidth == 8) writeCmdByte(c & 0xff);
//  if (_lcd_cmdWidth == 16) writeCmdWord(c);
  if (_lcd_capable & MIPI_DCS_REV1) {
	writeCmdByte(c & 0xff);
  } else {
	writeCmdWord(c);
  }	
}


void STM32_TFT_8bit::writeDataByte(uint8_t c) {
  CD_DATA;
  CS_ACTIVE;
  write8(c);
  CS_IDLE;
}


void STM32_TFT_8bit::writeDataWord(uint16_t c) {
  CD_DATA;
  CS_ACTIVE;
  write8(c >> 8);
  write8(c & 0xff);
  CS_IDLE;
}


void STM32_TFT_8bit::WriteCmdData(uint16_t cmd, uint16_t dat) {
  WriteCmd(cmd);
  writeDataWord(dat);
}


void STM32_TFT_8bit::WriteCmdParamN(uint8_t cmd, int8_t N, uint8_t * block) {
  writeCmdByte(cmd);
  while (N-- > 0) {
    uint8_t u8 = *block++;
    writeDataByte(u8);
  }
}

void STM32_TFT_8bit::WriteCmdParam4(uint8_t cmd, uint8_t d1, uint8_t d2, uint8_t d3, uint8_t d4) {
  uint8_t d[4];
  d[0] = d1, d[1] = d2, d[2] = d3, d[3] = d4;
  WriteCmdParamN(cmd, 4, d);
}


#define TFTLCD_DELAY 0xFFFF
#define TFTLCD_DELAY8  0x7F

void STM32_TFT_8bit::init_table(const void *table, int16_t size) {
  uint8_t *p = (uint8_t *) table, dat[24];            //R61526 has GAMMA[22] 
  while (size > 0) {
      uint8_t cmd = pgm_read_byte(p++);
      uint8_t len = pgm_read_byte(p++);
      if (cmd == TFTLCD_DELAY8) {
          delay(len);
          len = 0;
      } else {
          for (uint8_t i = 0; i < len; i++)
              dat[i] = pgm_read_byte(p++);
          WriteCmdParamN(cmd, len, dat);
      }
      size -= len + 2;
  }
}


void STM32_TFT_8bit::init_table16(const void *table, int16_t size) {
    uint16_t *p = (uint16_t *) table;
    while (size > 0) {
        uint16_t cmd = pgm_read_word(p++);
        uint16_t d = pgm_read_word(p++);
        if (cmd == TFTLCD_DELAY)
            delay(d);
        else {
            writeCmdWord(cmd);
            writeDataWord(d);
        }
        size -= 2 * sizeof(int16_t);
    }
}

void STM32_TFT_8bit::setResolution(int16_t width, int16_t height) {
    _lcd_width = width;
    _lcd_height = height;
}


void STM32_TFT_8bit::setOffset(int16_t offset) {
    _lcd_offset = offset;
}

// Rather than a bazillion writeCmdByte() and writeDataByte() calls, screen
// initialization commands and arguments are organized in these tables
// stored in PROGMEM.  The table may look bulky, but that's mostly the
// formatting -- storage-wise this is hundreds of bytes more compact
// than the equivalent code.  Companion function follows.


//void STM32_TFT_8bit::begin(void) {
void STM32_TFT_8bit::begin(uint16_t ID) {

  int16_t *p16;               //so we can "write" to a const protected variable.
  const uint8_t *table8_ads = NULL;
  int16_t table_size;

