nopnop2002/STM32_TFT_8bit/STM32_TFT_8bit.cpp
  }

  // Set screen resolution
  if (_lcd_width != 0 || _lcd_height !=0) {
        p16 = (int16_t *) & HEIGHT;
        *p16 = _lcd_height;
        p16 = (int16_t *) & WIDTH;
        *p16 = _lcd_width;
  }

  if (table8_ads != NULL) {
    static const uint8_t reset_off[] PROGMEM = {
      0x01, 0,            //Soft Reset
      TFTLCD_DELAY8, 150, // .kbv will power up with ONLY reset, sleep out, display on
      0x28, 0,            //Display Off
      0x3A, 1, 0x55,      //Pixel read=565, write=565.
    };
    static const uint8_t wake_on[] PROGMEM = {
      0x11, 0,            //Sleep Out
      TFTLCD_DELAY8, 150,
      0x29, 0,            //Display On
    };

  
    init_table(&reset_off, sizeof(reset_off));
    init_table(table8_ads, table_size);   //can change PIXFMT
    init_table(&wake_on, sizeof(wake_on));
  } 

  setRotation(0);             //PORTRAIT
  invertDisplay(false);


}

void STM32_TFT_8bit::drawPixel(int16_t x, int16_t y, uint16_t color)
{
    // MCUFRIEND just plots at edge if you try to write outside of the box:
  if (x < 0 || y < 0 || x >= width() || y >= height())
        return;
  if (_lcd_offset) {
    if (rotation == 2) y += _lcd_offset;
    if (rotation == 3) x += _lcd_offset;
  }

  #ifdef _DEBUG_
  Serial.print("drawPixel:x=" + String(x) + " y=" + String(y) + " color=" + String(color,HEX));
  Serial.print(" _MC=" + String(_MC,HEX));
  Serial.print(" _MP=" + String(_MP,HEX));
  Serial.println(" _MW=" + String(_MW,HEX));
  #endif

    if (_lcd_capable & MIPI_DCS_REV1) {
        WriteCmdParam4(_MC, x >> 8, x, x >> 8, x);
        WriteCmdParam4(_MP, y >> 8, y, y >> 8, y);
    } else {
        WriteCmdData(_MC, x);
        WriteCmdData(_MP, y);
    }
    WriteCmdData(_MW, color);
}


void STM32_TFT_8bit::setAddrWindow(uint16_t x, uint16_t y, uint16_t x1, uint16_t y1)
{

//  Serial.println("x=" + String(x) + " y=" + String(y));
//  Serial.println("x1=" + String(x1) + " y1=" + String(y1));
  if (_lcd_offset) {
    if (rotation == 2) {
      y += _lcd_offset;
      y1 += _lcd_offset;
    }
    if (rotation == 3) {
      x += _lcd_offset;
      x1 += _lcd_offset;
    }
  }

  if (_lcd_capable & MIPI_DCS_REV1) {
    WriteCmdParam4(_MC, x >> 8, x, x1 >> 8, x1);
    WriteCmdParam4(_MP, y >> 8, y, y1 >> 8, y1);
  } else {
    WriteCmdData(_MC, x);
    WriteCmdData(_MP, y);
    if (_lcd_capable & XSA_XEA_16BIT) {
      if (rotation & 1)
        y1 = y = (y1 << 8) | y;
      else
        x1 = x = (x1 << 8) | x;
    }
    WriteCmdData(_SC, x);
    WriteCmdData(_SP, y);
    WriteCmdData(_EC, x1);
    WriteCmdData(_EP, y1);
  }
//  WriteCmd(_MW); // write to RAM

}

void STM32_TFT_8bit::fillRect(int16_t x, int16_t y, int16_t w, int16_t h, uint16_t color)
{
    int16_t end;
    if (w < 0) {
        w = -w;
        x -= w;
    }                           //+ve w
    end = x + w;
    if (x < 0)
        x = 0;
    if (end > width())
        end = width();
    w = end - x;
    if (h < 0) {
        h = -h;
        y -= h;
    }                           //+ve h
    end = y + h;
    if (y < 0)
        y = 0;
    if (end > height())
        end = height();
    h = end - y;

    setAddrWindow(x, y, x + w - 1, y + h - 1);
    WriteCmd(_MW);
    if (h > w) {
        end = h;
        h = w;
        w = end;
    }
    while (h-- > 0) {
      end = w;
      do {
        writeDataWord(color);
      } while (--end != 0);
    }
    if (!(_lcd_capable & MIPI_DCS_REV1) || ((_lcd_ID == 0x1526) && (rotation & 1)))
        setAddrWindow(0, 0, width() - 1, height() - 1);
}



void STM32_TFT_8bit::pushColors8(uint8_t * block, int16_t n, bool first)
{
    uint16_t color;
    uint8_t h, l;

    if (first) {
      WriteCmd(_MW);
    }
    while (n-- > 0) {
        h = (*block++);
        l = (*block++);
        color = h << 8 | l;
        writeDataWord(color);
    }
}

void STM32_TFT_8bit::pushColors(uint16_t * block, int16_t n, bool first)
{
    uint16_t color;
    uint8_t h, l;

    if (first) {
      WriteCmd(_MW);
    }
    while (n-- > 0) {
        color = (*block++);
        writeDataWord(color);
    }
}



void STM32_TFT_8bit::drawFastVLine(int16_t x, int16_t y, int16_t h,
                                        uint16_t color) {

  // Rudimentary clipping
  if ((x >= _width) || (y >= _height || h < 1)) return;
  if ((y + h - 1) >= _height) h = _height - y;
  fillRect(x, y, 1, h, color);
}


void STM32_TFT_8bit::drawFastHLine(int16_t x, int16_t y, int16_t w,
                                        uint16_t color) {

  // Rudimentary clipping
  if ((x >= _width) || (y >= _height || w < 1)) return;
  if ((x + w - 1) >= _width)  w = _width - x;
  fillRect(x, y, w, 1, color);
}

void STM32_TFT_8bit::fillScreen(uint16_t color) {
  fillRect(0, 0, _width, _height, color);
}

/*
* Draw lines faster by calculating straight sections and drawing them with fastVline and fastHline.
*/
#if defined (__STM32F1__)
void STM32_TFT_8bit::drawLine(int16_t x1, int16_t y1, int16_t x2, int16_t y2, uint16_t color) {

  int16_t i;
  int16_t dx,dy;
  int16_t sx,sy;
  int16_t E;
  #ifdef _DEBUG_
  Serial.println("drawLine:x1=" + String(x1) + " x2=" + String(x2) + " y1=" + String(y1) + " y2=" + String(y2));
  #endif
  
  /* distance between two points */
  dx = ( x2 > x1 ) ? x2 - x1 : x1 - x2;
  dy = ( y2 > y1 ) ? y2 - y1 : y1 - y2;

  /* direction of two point */
  sx = ( x2 > x1 ) ? 1 : -1;
  sy = ( y2 > y1 ) ? 1 : -1;

  if (y1 == y2) {
    if (x2 > x1) {
      drawFastHLine(x1, y1, x2 - x1 + 1, color);
    } else {
      drawFastHLine(x2, y1, x1 - x2 + 1, color);
    }
    return;
  } else if (x1 == x2) {
    if (y2 > y1) {
      drawFastVLine(x1, y1, y2 - y1 + 1, color);
    } else {
      drawFastVLine(x1, y2, y1 - y2 + 1, color);
    }
    return;
  }

  /* inclination < 1 */
  if ( dx > dy ) {
    E = -dx;
    for ( i = 0 ; i <= dx ; i++ ) {
      drawPixel( x1, y1, color );
      x1 += sx;
      E += 2 * dy;
      if ( E >= 0 ) {
        y1 += sy;
        E -= 2 * dx;
      }
    }
  /* inclination >= 1 */
  } else {
    E = -dy;
    for ( i = 0 ; i <= dy ; i++ ) {
      drawPixel( x1, y1, color );
      y1 += sy;
      E += 2 * dx;
      if ( E >= 0 ) {
        x1 += sx;
        E -= 2 * dy;
      }
    }
  }
}

#endif


