nopnop2002/STM32_TFT_8bit/STM32_TFT_8bit.cpp
// Pass 8-bit (each) R,G,B, get back 16-bit packed color
uint16_t STM32_TFT_8bit::color565(uint8_t r, uint8_t g, uint8_t b) {
  return ((r & 0xF8) << 8) | ((g & 0xFC) << 3) | (b >> 3);
}


// independent cursor and window registers.   ILI9341/9342 auto increments.  ILI9320/9325 do not.  
// VERY VERY SLOW !!
int16_t STM32_TFT_8bit::readGRAM(int16_t x, int16_t y, uint16_t * block, int16_t w, int16_t h)
{
    uint16_t ret, dummy, _MR = _MW;
    int16_t n = w * h, row = 0, col = 0;
    uint8_t r, g, b, tmp;
    if (!is8347 && _lcd_capable & MIPI_DCS_REV1) // HX8347 uses same register
        _MR = 0x2E;
    setAddrWindow(x, y, x + w - 1, y + h - 1);
    while (n > 0) {
        if (!(_lcd_capable & MIPI_DCS_REV1)) {
            WriteCmdData(_MC, x + col);
            WriteCmdData(_MP, y + row);
        }
        WriteCmd(_MR);
        setReadDataBus();
        CS_ACTIVE;
        CD_DATA;
        if (_lcd_capable & READ_NODUMMY) {
            ;
        } else if ((_lcd_capable & MIPI_DCS_REV1) || _lcd_ID == 0x1289) {
            r=read8();
        } else {
            dummy=read16bits();
        }
		if (_lcd_ID == 0x1511) r=read8();   //extra dummy for R61511
        while (n) {
            if (_lcd_capable & READ_24BITS) {
                r=read8();
                g=read8();
                b=read8();
                if (_lcd_capable & READ_BGR)
                    ret = color565(b, g, r);
                else
                    ret = color565(r, g, b);
            } else {
                ret=read16bits();
                if (_lcd_capable & READ_LOWHIGH)
                    ret = (ret >> 8) | (ret << 8);
                if (_lcd_capable & READ_BGR)
                    ret = (ret & 0x07E0) | (ret >> 11) | (ret << 11);
            }
            *block++ = ret;
            n--;
            if (!(_lcd_capable & AUTO_READINC))
                break;
        }
        if (++col >= w) {
            col = 0;
            if (++row >= h)
                row = 0;
        }
        RD_IDLE;
//        CS_IDLE;
        setWriteDataBus();
    }
    if (!(_lcd_capable & MIPI_DCS_REV1))
        setAddrWindow(0, 0, width() - 1, height() - 1);
    return 0;
}


void STM32_TFT_8bit::setRotation(uint8_t r) {
    uint16_t GS, SS, ORG, REV = _lcd_rev;
    uint8_t val, d[3];
    rotation = r & 3;           // just perform the operation ourselves on the protected variables
    _width = (rotation & 1) ? HEIGHT : WIDTH;
    _height = (rotation & 1) ? WIDTH : HEIGHT;

    #ifdef _DEBUG_
    Serial.println("setRotation:r=" + String(r));
    Serial.println("setRotation:rotation=" + String(rotation));
    Serial.println("setRotation:WIDTH=" + String(WIDTH));
    Serial.println("setRotation:HEIGHT=" + String(HEIGHT));
    Serial.println("setRotation:_width=" + String(_width));
    Serial.println("setRotation:_height=" + String(_height));
    Serial.println("setRotation:width()=" + String(width()));
    Serial.println("setRotation:height()=" + String(height()));
    #endif
  
    switch (rotation) {
    case 0:                    //PORTRAIT:
      val = 0x48;              //MY=0, MX=1, MV=0, ML=0, BGR=1
      break;
    case 1:                    //LANDSCAPE: 90 degrees
      val = 0x28;              //MY=0, MX=0, MV=1, ML=0, BGR=1
      break;
    case 2:                    //PORTRAIT_REV: 180 degrees
      val = 0x98;              //MY=1, MX=0, MV=0, ML=1, BGR=1
      break;
    case 3:                    //LANDSCAPE_REV: 270 degrees
      val = 0xF8;              //MY=1, MX=1, MV=1, ML=1, BGR=1
      break;
    }

    if (_lcd_capable & INVERT_GS)
      val ^= 0x80;
    if (_lcd_capable & INVERT_SS)
      val ^= 0x40;
    if (_lcd_capable & INVERT_RGB)
      val ^= 0x08;

    if (_lcd_capable & MIPI_DCS_REV1) {
        if (_lcd_ID == 0x6814) {  //.kbv my weird 0x9486 might be 68140
            GS = (val & 0x80) ? (1 << 6) : 0;   //MY
            SS = (val & 0x40) ? (1 << 5) : 0;   //MX
            val &= 0x28;        //keep MV, BGR, MY=0, MX=0, ML=0
            d[0] = 0;
            d[1] = GS | SS | 0x02;      //MY, MX
            d[2] = 0x3B;
            WriteCmdParamN(0xB6, 3, d);
            goto common_MC;
        } else if (_lcd_ID == 0x1963 || _lcd_ID == 0x9481 || _lcd_ID == 0x1511) {
            if (val & 0x80)
                val |= 0x01;    //GS
            if ((val & 0x40))
                val |= 0x02;    //SS
            if (_lcd_ID == 0x1963) val &= ~0xC0;
            if (_lcd_ID == 0x9481) val &= ~0xD0;
            if (_lcd_ID == 0x1511) {
                val &= ~0x10;   //remove ML
                val |= 0xC0;    //force penguin 180 rotation
            }
//            val &= (_lcd_ID == 0x1963) ? ~0xC0 : ~0xD0; //MY=0, MX=0 with ML=0 for ILI9481
            goto common_MC;
        } else if (is8347) {
            _MC = 0x02, _MP = 0x06, _MW = 0x22, _SC = 0x02, _EC = 0x04, _SP = 0x06, _EP = 0x08;
			if (_lcd_ID == 0x5252) {
			    val |= 0x02;   //VERT_SCROLLON
				if (val & 0x10) val |= 0x04;   //if (ML) SS=1 kludge mirror in XXX_REV modes
            }
			goto common_BGR;
        }
      common_MC:
        _MC = 0x2A, _MP = 0x2B, _MW = 0x2C, _SC = 0x2A, _EC = 0x2A, _SP = 0x2B, _EP = 0x2B;
      common_BGR:
        WriteCmdParamN(is8347 ? 0x16 : 0x36, 1, &val);
       _lcd_madctl = val;
//       if (_lcd_ID	== 0x1963) WriteCmdParamN(0x13, 0, NULL);   //NORMAL mode
  }


    else {
     uint16_t GS, SS, ORG, REV = _lcd_rev;
     switch (_lcd_ID) {
        case 0x5420:
        case 0x7793:
        case 0x9326:
		case 0xB509:
            _MC = 0x200, _MP = 0x201, _MW = 0x202, _SC = 0x210, _EC = 0x211, _SP = 0x212, _EP = 0x213;
            GS = (val & 0x80) ? (1 << 15) : 0;
			uint16_t NL;
			NL = ((432 / 8) - 1) << 9;
            if (_lcd_ID == 0x9326 || _lcd_ID == 0x5420) NL >>= 1;
            WriteCmdData(0x400, GS | NL);
            goto common_SS;
        default:
            _MC = 0x20, _MP = 0x21, _MW = 0x22, _SC = 0x50, _EC = 0x51, _SP = 0x52, _EP = 0x53;
            GS = (val & 0x80) ? (1 << 15) : 0;
            WriteCmdData(0x60, GS | 0x2700);    // Gate Scan Line (0xA700)
          common_SS:
            SS = (val & 0x40) ? (1 << 8) : 0;
            WriteCmdData(0x01, SS);     // set Driver Output Control
          common_ORG:
            ORG = (val & 0x20) ? (1 << 3) : 0;
            if (val & 0x08)
                ORG |= 0x1000;  //BGR
            _lcd_madctl = ORG | 0x0030;
            WriteCmdData(0x03, _lcd_madctl);    // set GRAM write direction and BGR=1.
            break;
		}
    }


  if ((rotation & 1) && ((_lcd_capable & MV_AXIS) == 0)) {
      uint16_t x;
      x = _MC, _MC = _MP, _MP = x;
      x = _SC, _SC = _SP, _SP = x;    //.kbv check 0139
      x = _EC, _EC = _EP, _EP = x;    //.kbv check 0139
  }

  #ifdef _DEBUG_
  Serial.println("setRotation:_MC=" + String(_MC,HEX));
  Serial.println("setRotation:_MP=" + String(_MP,HEX));
  Serial.println("setRotation:_MW=" + String(_MW,HEX));
  Serial.println("setRotation:_SC=" + String(_SC,HEX));
  Serial.println("setRotation:_SP=" + String(_SP,HEX));
  Serial.println("setRotation:_EC=" + String(_EC,HEX));
  Serial.println("setRotation:_EP=" + String(_EP,HEX));
  Serial.println("setRotation:width=" + String(width()));
  Serial.println("setRotation:height=" + String(height()));
  #endif
  setAddrWindow(0, 0, width() - 1, height() - 1);
  vertScroll(0, HEIGHT, 0);   //reset scrolling after a rotation


