nopnop2002/STM32_TFT_8bit/STM32_TFT_8bit.cpp
}

void STM32_TFT_8bit::vertScroll(int16_t top, int16_t scrollines, int16_t offset)
{
    if (_lcd_offset) {
      if (rotation == 2 || rotation == 3) top += _lcd_offset;
    }
    int16_t bfa = HEIGHT - top - scrollines;  // bottom fixed area
    int16_t vsp;
    int16_t sea = top;
	if (_lcd_ID == 0x9327) bfa += 32;
    if (offset <= -scrollines || offset >= scrollines) offset = 0; //valid scroll
	vsp = top + offset; // vertical start position
    if (offset < 0)
        vsp += scrollines;          //keep in unsigned range
    sea = top + scrollines - 1;
    if (_lcd_capable & MIPI_DCS_REV1) {
        uint8_t d[6];           // for multi-byte parameters
        d[0] = top >> 8;        //TFA
        d[1] = top;
        d[2] = scrollines >> 8; //VSA
        d[3] = scrollines;
        d[4] = bfa >> 8;        //BFA
        d[5] = bfa;
        WriteCmdParamN(is8347 ? 0x0E : 0x33, 6, d);
//        if (offset == 0 && rotation > 1) vsp = top + scrollines;   //make non-valid
		d[0] = vsp >> 8;        //VSP
        d[1] = vsp;
        WriteCmdParamN(is8347 ? 0x14 : 0x37, 2, d);
		if (is8347) { 
		    d[0] = (offset != 0) ? (_lcd_ID == 0x8347 ? 0x02 : 0x08) : 0;
			WriteCmdParamN(_lcd_ID == 0x8347 ? 0x18 : 0x01, 1, d);  //HX8347-D
		} else if (offset == 0 && (_lcd_capable & MIPI_DCS_REV1)) {
			WriteCmdParamN(0x13, 0, NULL);    //NORMAL i.e. disable scroll
		}
		return;
    } else {
//        Serial.println("top=" + String(top) + " vsp=" + String(vsp));
        if (top != 0) return;
        // cope with 9320 style variants:
        switch (_lcd_ID) {
          case 0x7783:
            WriteCmdData(0x61, _lcd_rev);   //!NDL, !VLE, REV
            WriteCmdData(0x6A, vsp);        //VL#
            break;
	      case 0x5420:
          case 0x7793:
	      case 0x9326:
	      case 0xB509:
            WriteCmdData(0x401, (1 << 1) | _lcd_rev);       //VLE, REV 
            WriteCmdData(0x404, vsp);       //VL# 
            break;
          default:
            // 0x6809, 0x9320, 0x9325, 0x9335, 0xB505 can only scroll whole screen
            WriteCmdData(0x61, (1 << 1) | _lcd_rev);        //!NDL, VLE, REV
            WriteCmdData(0x6A, vsp);        //VL#
            break;
        }
    }
}



void STM32_TFT_8bit::invertDisplay(boolean i) {
  uint8_t val;
  _lcd_rev = ((_lcd_capable & REV_SCREEN) != 0) ^ i;
  #if _DEBUG_
  Serial.println("invertDisplay=" + String(_lcd_rev,HEX));
  #endif

  if (_lcd_capable & MIPI_DCS_REV1) {
        if (is8347) {
            // HX8347D: 0x36 Panel Characteristic. REV_Panel
            // HX8347A: 0x36 is Display Control 10
            if (_lcd_ID == 0x8347 || _lcd_ID == 0x5252) // HX8347-A, HX5352-A
			    val = _lcd_rev ? 6 : 2;       //INVON id bit#2,  NORON=bit#1
            else val = _lcd_rev ? 8 : 10;     //HX8347-D, G, I: SCROLLON=bit3, INVON=bit1
            // HX8347: 0x01 Display Mode has diff bit mapping for A, D 
            WriteCmdParamN(0x01, 1, &val);
        } else {
            #if _DEBUG_
            Serial.println("invertDisplay 0x21/20");
            #endif
            WriteCmdParamN(_lcd_rev ? 0x21 : 0x20, 0, NULL);
        }
        return;
  }
  // cope with 9320 style variants:
  switch (_lcd_ID) {
    case 0x9225:                                        //REV is in reg(0x07) like Samsung
    case 0x9226:
    case 0x0154:
        WriteCmdData(0x07, 0x13 | (_lcd_rev << 2));     //.kbv kludge
        break;
	case 0x5420:
    case 0x7793:
    case 0x9326:
	case 0xB509:
        WriteCmdData(0x401, (1 << 1) | _lcd_rev);       //.kbv kludge VLE 
        break;
    default:
        #if _DEBUG_
        Serial.println("invertDisplay 0x61");
        #endif
        WriteCmdData(0x61, _lcd_rev);
        break;
  }
}



uint8_t STM32_TFT_8bit::read8(void){
  RD_ACTIVE;
  delay(5);
  uint8_t temp = (TFT_DATA->regs->IDR & 0x00FF);
  RD_IDLE;
  delay(5);
  return temp;
}

#if 0
uint8_t STM32_TFT_8bit::readcommand8(uint8_t c) {
  setWriteDataBus();
  writeCmdByte(c);
  setReadDataBus();
  CS_ACTIVE;
  CD_DATA;
  uint8_t data = read8();
  CS_IDLE;
  setWriteDataBus();
  return data;
}
#endif



uint16_t STM32_TFT_8bit::read16bits(void)
{
  uint16_t ret;
  uint8_t lo;
  uint8_t hi;
  CS_ACTIVE;
  CD_DATA;
  hi = read8();
  //all MIPI_DCS_REV1 style params are 8-bit
  lo = read8();
  CS_IDLE;
  return (hi << 8) | lo;
}


uint16_t STM32_TFT_8bit::readReg16(uint16_t reg)
{
  uint16_t ret;
  uint8_t lo;
#if 0
  if (!done_reset)
        reset();
#endif
  setWriteDataBus();
  writeCmdWord(reg);
  setReadDataBus();
  //    READ_16(ret);
  ret = read16bits();
  setWriteDataBus();
  return ret;
}

uint16_t STM32_TFT_8bit::readReg16Index(uint16_t reg, int8_t index)
{
  uint16_t ret;
  uint8_t lo;
#if 0
  if (!done_reset)
        reset();
#endif
  setWriteDataBus();
  writeCmdByte(reg);
  setReadDataBus();
  //    READ_16(ret);
  do { ret = read16bits(); }while (--index >= 0);  //need to test with SSD1963
  setWriteDataBus();
  return ret;
}


uint32_t STM32_TFT_8bit::readReg32(uint16_t reg)
{
    uint16_t h = readReg16Index(reg, 0);
    uint16_t l = readReg16Index(reg, 1);
    return ((uint32_t) h << 16) | (l);
}

uint32_t STM32_TFT_8bit::readReg40(uint16_t reg)
{
    uint16_t h = readReg16Index(reg, 0);
    uint16_t m = readReg16Index(reg, 1);
    uint16_t l = readReg16Index(reg, 2);
    return ((uint32_t) h << 24) | (m << 8) | (l >> 8);
}


uint16_t STM32_TFT_8bit::readID(void)
{
    uint16_t ret, ret2;
    uint8_t msb;
    ret = readReg16(0);           //forces a reset() if called before begin()
    Serial.println("readReg16(0)=0x" + String(ret,HEX));
    if (ret == 0x5408)          //the SPFD5408 fails the 0xD3D3 test.
        return 0x5408;
    if (ret == 0x5420)          //the SPFD5420 fails the 0xD3D3 test.
        return 0x5420;
    if (ret == 0x8989)          //SSD1289 is always 8989
        return 0x1289;
    ret = readReg16(0x67);        //HX8347-A
    if (ret == 0x4747)
        return 0x8347;

    ret = readReg32(0xA1);      //SSD1963: [01 57 61 01]
    Serial.println("readReg32(A1)=0x" + String(ret,HEX));
    if (ret == 0x6101)
        return 0x1963;
    if (ret == 0xFFFF)          //R61526: [xx FF FF FF]
        return 0x1526;          //subsequent begin() enables Command Access
//    if (ret == 0xFF00)          //R61520: [xx FF FF 00]
//        return 0x1520;          //subsequent begin() enables Command Access

